Attribute VB_Name = "mduErrorModule"
'/**************************************************************************
'                 版权所有 (c), 2004 - 2xxx, 绿豆工作室
'
' ************************   模 块 名   :mduErrorModule********************
'版 本 号: V1.0
'作    者: 陈缘
'生成日期: 2004年03月07日
'最近修改:
'功能描述:
'函数列表:
'修改历史:
'日    期: 2004年03月07日
'修改人员: 陈缘
'修改内容: 生成
'******************************************************************************/
'
Option Explicit
'本模块名称
Private Const THIS_MODULE_NAME As String = "mduErrorModule"

'
'/*----------------------------------------------*
' * VB环境参量的设置(如：Option Explicit)         *
' *----------------------------------------------*/
'
'/*----------------------------------------------*
' * 使用过的外部变量说明                          *
' *----------------------------------------------*/
'
'/*----------------------------------------------*
' * 使用过的动态连接库函数声明                    *
' *----------------------------------------------*/
'
'/*----------------------------------------------*
' * 使用过的外部函数原型说明(如：Module,Class)    *
' *----------------------------------------------*/
'
'/*----------------------------------------------*
' * 内部的公共函数原型说明(如：提供给其他模块使用) *
' *----------------------------------------------*/
'
'/*----------------------------------------------*
' * 本系统全局变量                                *
' *----------------------------------------------*/
'
'/*----------------------------------------------*
' * 本模块变量                                   *
' *----------------------------------------------*/
'
'/*----------------------------------------------*
' * 自定义类型                                   *
' *----------------------------------------------*/
'
'/*----------------------------------------------*
' * 常量定义                                     *
' *----------------------------------------------*/
'

'/**********************************函 数 名  : funcErr*********************/
'功能描述:    通用函数模版
'输入参数:

'输出参数:    无
'返 回 值:    ---
'调用函数:
'被调函数:
'
'修改历史:
'创建日期:    2003-03-17 15:34:45
'作    者:    陈缘
'修改方式:    新生成函数
'/**************************************************************************/

Function funcErr()
    On Error GoTo errSta
    Exit Function
errSta:
    '自定义错误处理
    
    '调用默认错误处理函数
    'Call DefaultErrorHandler
End Function


'/**********************************函 数 名  : subErr*********************/
'功能描述:    通用过程模版
'输入参数:

'输出参数:    无
'返 回 值:    ---
'调用函数:
'被调函数:
'
'修改历史:
'创建日期:    2003-03-17 15:35:36
'作    者:    陈缘
'修改方式:    新生成函数
'/*************************************************************************/

Sub subErr()
    On Error GoTo errSta
    Exit Sub
errSta:
    '自定义错误处理
    
    '调用默认错误处理函数
    'Call DefaultErrorHandler
End Sub


'/**********************************函 数 名  : DefaultErrorHandler*********************/
'功能描述:    默认错误处理函数
'输入参数:

'输出参数:    无
'返 回 值:    String
'调用函数:
'被调函数:
'
'修改历史:
'创建日期:    2003-03-17 15:36:24
'作    者:    陈缘
'修改方式:    新生成函数
'/**************************************************************************************/

Public Function DefaultErrorHandler(sModuleName As String) As String
    Debug.Print Err.Number, Err.Description, Err.Source
End Function



'/**********************************函 数 名  : RaiseError*********************/
'功能描述:    生成错误消息
'输入参数:
'            lErrorNumber
'             lErrorDescription
'             lErrorSource

'输出参数:    无
'返 回 值:    String
'调用函数:
'被调函数:
'
'修改历史:
'创建日期:    2003-03-17 15:37:20
'作    者:    陈缘
'修改方式:    新生成函数
'/*****************************************************************************/

Public Function RaiseError(lErrorNumber, lErrorDescription, lErrorSource) As String
    Err.Raise Number:=lErrorNumber, Description:=lErrorDescription, Source:=lErrorSource
End Function

